{
  "cotton": "The fertilizer dose of 100:50:50 (NPK) kg/ha for irrigated cotton; 80 :40:40 (NPK) kg/ha for rainfed cotton hybrids and 50:25:25 NPK kg/ha both for desi and hirsutum varieties are recommended.",
  "rice": "Recommended fertilizer phosphorus (P at 25 kg/ha) Apply N & K in three splits at 20-25, 40-45 and 60-65 days after germination. Each split may follow 25kg N and 12.5 kg K2O.",
  "sugercane": "To provide all micronutrients to sugarcane, 50 kg /ha of micronutrient mixture containing 20 kg Ferrous sulphate,10 kg Manganese sulphate, 10 kg Zinc sulphate, 5 kg of Copper sulphate, 5 kg of Borax mixed with 100 kg of well decomposed FYM",
  "cabbage": "Cabbage heading, each acre usually requires about 18 kg of urea, about 8 to 10 kg potash fertilizers, and about 3 kg of phosphate fertilizer",
  "tomato": "tomato needs 40: 24: 24 kg N: P: K/acre-for varieties and 60: 36: 36 kg N: P: K/acre-for hybrids. In varieties- Apply 50% of N fertilizer dose as basal before transplanting. Apply entire dose of phosphatic fertilizers at the time of last ploughing/transplanting in case of varieties.",
  "carrots": "30 t/ha FYM and 90:90:90 kg/ha NPK are applied as basal dose and 45:45:45 kg/ha NPK after 45 days of sowing. Apply 25 kg of ZnSO4/ha as basal.",
  "water melon": "Treat with Trichoderma viiridi 4 g or Pseudomonas fluorescens 10 g or Carbendizim 2g/kg of seeds. Apply FYM 20 t/ha, P 55 kg and K 55 kg as basal and N 55 kg/ha 30 days after sowing.Apply Azospirillum and Phosphobacteria @ 2 kg/ha and Pseudomonoas @ 2.5 kg/ha along with FYM 50 kg and neem cake 100 kg before last ploughing.",
  "beans": "As beans are nitrogen-fixing plants, pick fertilizers that are rich in other nutrients like phosphorus and potassium.",
  "potatos": "A fertilizer dose of 180-240 kg N, 60-90 kg P2 O5 and 85- 25 130 K2O per hectare is recommended for alluvial soils of Indo Gangetic plains. In the hill zone, the 2 application of 100-150 kg N, 100-150 kg P2 O5 and 50-100 kg K2O per hectare is recommended.",
  "broccoli": "farmers apply a balanced fertilizer (N-P-K 20-20-20) at a total rate of 800kg per hectare throughout the growing period. They apply up to 400kg per hectare at transplanting or direct seeding, 200kg per hectare about 3-4 weeks later, and 200kg per hectare about 6 or 7 weeks after planting.",
  "tobacco": "fertilizers at 40-45Kg N, 50Kg P205 and 50Kg K205 per hectare per year for Northern, Central and Southern black soils of Andhra Pradesh are recommended for light cast Varieti"
}